Autodesk.Revit.DB.MEPSystem.DivideSystem(Autodesk.Revit.DB.Document)
Divide the phyisical networks in the system and create a new system for each network.
Remarks:
This function only works for Hvac and Piping system.
ADoc:
The document.
Returns:
The id of new created systems.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The system is not dividable.
Since:
2014

Autodesk.Revit.DB.MEPSystem.GetPhysicalNetworksNumber
Get the physical networks number in the system.
Returns:
The number of physical networks.
Since:
2014

Autodesk.Revit.DB.MEPSystem.IsSystemDividable
Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
Returns:
True if the system can be divided.
Since:
2014

Autodesk.Revit.DB.MEPSystem.GetCriticalPathSectionNumbers
Obtains a list of the critical path section numbers.
Remarks:
The section numbers are returned in order in the direction of flow.
Returns:
The section numbers.
Since:
2013

Autodesk.Revit.DB.MEPSystem.GetSectionByNumber(System.Int32)
Get the Section from section number
sectionNumber:
The Section number.
Returns:
The section. null if the no section exists for the input section number.
Since:
2013

Autodesk.Revit.DB.MEPSystem.GetSectionByIndex(System.Int32)
Get the section from the index.
index:
The index of the section in the system.
Returns:
The section.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The section index is out of range.
Since:
2013

Autodesk.Revit.DB.MEPSystem.HasPlaceholders
Indicates if the system has one or more placeholders.
Since:
2015

Autodesk.Revit.DB.MEPSystem.HasDesignParts
Indicates if the system has one or more design parts.
Since:
2015

Autodesk.Revit.DB.MEPSystem.HasFabricationParts
Indicates if the system has one or more fabrication parts.
Since:
2015

Autodesk.Revit.DB.MEPSystem.IsMultipleNetwork
Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
Since:
2014

Autodesk.Revit.DB.MEPSystem.PressureLossOfCriticalPath
The total pressure loss of the sections in critical path.
Since:
2013

Autodesk.Revit.DB.MEPSystem.SectionsCount
The number of sections.
Since:
2013

Autodesk.Revit.DB.MEPSystem.IsEmpty
Indicates if the system is empty or not.
Remarks:
returns true if the system doesn't contain any components
Since:
2011

Autodesk.Revit.DB.MEPSystem.IsValid
Indicates if the system is valid or not.
atom AtomValidateSystem
default false
Since:
2011

Autodesk.Revit.DB.MEPSystem.Remove(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Remove elements from system.
Remarks:
It is forbidden to remove all terminal elements from system.
Terminal elements will be removed from the system automatically after removing this system from document.
elementIds: The elements to be removed from the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument elements is null, or any element in that collection is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when some of the elements can't be removed, or when trying to remove all elements from the system.
The element which connect to the base equipment can't be removed,
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the operation failed.

Autodesk.Revit.DB.MEPSystem.Remove(Autodesk.Revit.DB.ConnectorSet)
Removes connectors from system.
connectors: The connectors to be removed from the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument elements is null, or any element in that collection is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when some of the connectors can't be removed, or when trying to remove all connectors from the system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the operation failed.

Autodesk.Revit.DB.MEPSystem.Add(Autodesk.Revit.DB.ConnectorSet)
Add elements into the system and connect them with the system using given connectors.
Remarks:
Note: this method may not be called during dynamic update.
connectors: Connectors which are used to connect with the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connectors is null, or any connector in that collection is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Throw when any of the input connectors have been already used,
or when they don't share the same domain or system type as the system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the operation failed.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Thrown if this method is called during dynamic update.

Autodesk.Revit.DB.MEPSystem.BaseEquipmentConnector
The connector within base equipment which is used to connect with system.
Returns:
Returns the connector which connects with the system within base equipment if base equipment has been assigned to system,
otherwise returns null.

Autodesk.Revit.DB.MEPSystem.BaseEquipment
The base panel or equipment of the system.

Autodesk.Revit.DB.MEPSystem.Elements
Terminal elements in the system.
Remarks: The return value is a read only collection and doesn't include the base equipment or panel.

Autodesk.Revit.DB.MEPSystem.ConnectorManager
Connector manager of the system.
Remarks: The connector manager includes connectors which are used to connect with terminal elements and base equipment.

Autodesk.Revit.DB.MEPSystem
A system in the Autodesk Revit MEP product.
Remarks:
This is the base class for electrical, mechanical and piping systems,
available only in the Autodesk Revit MEP product.
Since:
2011